Infineon/cmsis_packs/TLE986x/Infineon.TLE986x_DFP.pdsc
		<file category="header" name="Device/SDK/cfgwiz/TLE986x_20/v1/adc2_defines.h" 			attr="config" condition="TLE986x_20" 			version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE986x_40/v1/adc2_defines.h" 			attr="config" condition="TLE986x_40" 			version="1.8.6"/>

		<file category="header" name="Device/SDK/cfgwiz/TLE986x_20/v1/bdrv_defines.h" 			attr="config" condition="TLE986x_20" 			version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE986x_40/v1/bdrv_defines.h" 			attr="config" condition="TLE986x_40" 			version="1.8.6"/>

		<file category="header" name="Device/SDK/cfgwiz/TLE986x_20/v1/csa_defines.h" 			attr="config" condition="TLE986x_20" 			version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE986x_40/v1/csa_defines.h" 			attr="config" condition="TLE986x_40" 			version="1.8.6"/>
		
		<file category="header" name="Device/SDK/cfgwiz/TLE986x_20/v1/gpt12e_defines.h" 		attr="config" condition="TLE986x_20" 			version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE986x_40/v1/gpt12e_defines.h" 		attr="config" condition="TLE986x_40" 			version="1.8.6"/>
		
		<file category="header" name="Device/SDK/cfgwiz/TLE986x_20/v1/int_defines.h" 			attr="config" condition="TLE986x_20" 			version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE986x_40/v1/int_defines.h" 			attr="config" condition="TLE986x_40" 			version="1.8.6"/>
		
		<file category="header" name="Device/SDK/cfgwiz/TLE986x_20/v1/mon_defines.h" 			attr="config" condition="TLE986x_20" 			version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE986x_40/v1/mon_defines.h"			attr="config" condition="TLE986x_40" 			version="1.8.6"/>
		
		<file category="header" name="Device/SDK/cfgwiz/TLE986x_20/v1/port_defines.h" 			attr="config" condition="TLE986x_20" 			version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE986x_40/v1/port_defines.h" 			attr="config" condition="TLE986x_40" 			version="1.8.6"/>
		
		<file category="header" name="Device/SDK/cfgwiz/TLE986x_20/v1/timer3_defines.h" 		attr="config" condition="TLE986x_20" 			version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE986x_40/v1/timer3_defines.h" 		attr="config" condition="TLE986x_40" 			version="1.8.6"/>
		
		<file category="header" name="Device/SDK/cfgwiz/TLE986x_20/v1/dma_defines.h" 			attr="config" condition="TLE986x_20" 			version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE986x_40/v1/dma_defines.h" 			attr="config" condition="TLE986x_40" 			version="1.8.6"/>
	 </files>
    </component>

	<component Cclass="Device" Cgroup="ConfigWizard_v2" Cversion="2.1.12" condition="Only ConfigWizard_v2">  <!-- Cversion is necessary -->
	 <description>Infineon ConfigWizard Configuration File</description>
	 <RTE_Components_h>
          #define CONFIGWIZARD 2
     </RTE_Components_h>
	 <files>
		<file category="doc" name="Device/SDK/cfgwiz/TLE986x_20/v2/config.icwp"              	attr="config" condition="TLE986x_20" version="1.8.6"/>
        <file category="doc" name="Device/SDK/cfgwiz/TLE986x_40/v2/config.icwp"              	attr="config" condition="TLE986x_40" version="1.8.6"/>
		
		<file category="doc" 	name="SVD/TLE986x.svd" 											attr="config" condition="TLE986x" 	 version="3.5.0"/>
		<file category="doc"    name="Device/SDK/cfgwiz/script/v2/ICW_TLE986x.xml"           	attr="config" condition="TLE986x"    version="2.0.2"/>
        <file category="doc"    name="Device/SDK/cfgwiz/script/v2/TLE986x.mig"           		attr="config" condition="TLE986x"    version="2.0.2"/>
		
		<!-- _defines.h which contens are the same between both versions of the Config Wizard -->	
		<file category="header" name="Device/SDK/cfgwiz/TLE986x_20/v2/ccu6_defines.h" 			attr="config" condition="TLE986x_20" version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE986x_40/v2/ccu6_defines.h" 			attr="config" condition="TLE986x_40" version="1.8.6"/>
		
		<file category="header" name="Device/SDK/cfgwiz/TLE986x_20/v2/isr_defines.h" 			attr="config" condition="TLE986x_20" version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE986x_40/v2/isr_defines.h" 			attr="config" condition="TLE986x_40" version="1.8.6"/> 

		<file category="header" name="Device/SDK/cfgwiz/TLE986x_20/v2/lin_defines.h" 			attr="config" condition="TLE986x_20" version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE986x_40/v2/lin_defines.h" 			attr="config" condition="TLE986x_40" version="1.8.6"/>

		<file category="header" name="Device/SDK/cfgwiz/TLE986x_20/v2/ssc_defines.h" 			attr="config" condition="TLE986x_20" version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE986x_40/v2/ssc_defines.h" 			attr="config" condition="TLE986x_40" version="1.8.6"/>
		
		<file category="header" name="Device/SDK/cfgwiz/TLE986x_20/v2/timer2x_defines.h" 		attr="config" condition="TLE986x_20" version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE986x_40/v2/timer2x_defines.h" 		attr="config" condition="TLE986x_40" version="1.8.6"/>
		
		<file category="header" name="Device/SDK/cfgwiz/TLE986x_20/v2/uart_defines.h" 			attr="config" condition="TLE986x_20" version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE986x_40/v2/uart_defines.h" 			attr="config" condition="TLE986x_40" version="1.8.6"/> 
		
		<!-- _defines.h for which you have to differentiate between both versions of the Config Wizard -->		
		<file category="header"  name="Device/SDK/cfgwiz/TLE986x_20/v2/bsl_defines.h" 			attr="config" condition="TLE986x_20" version="1.8"/>
        <file category="header"  name="Device/SDK/cfgwiz/TLE986x_40/v2/bsl_defines.h" 			attr="config" condition="TLE986x_40" version="1.8"/>
		
		<file category="header" name="Device/SDK/cfgwiz/TLE986x_20/v2/scu_defines.h" 			attr="config" condition="TLE986x_20" version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE986x_40/v2/scu_defines.h" 			attr="config" condition="TLE986x_40" version="1.8.6"/>
		
		<file category="header" name="Device/SDK/cfgwiz/TLE986x_20/v2/pmu_defines.h" 			attr="config" condition="TLE986x_20" version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE986x_40/v2/pmu_defines.h" 			attr="config" condition="TLE986x_40" version="1.8.6"/>
		
		<file category="header" name="Device/SDK/cfgwiz/TLE986x_20/v2/adc1_defines.h" 			attr="config" condition="TLE986x_20" version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE986x_40/v2/adc1_defines.h" 			attr="config" condition="TLE986x_40" version="1.8.6"/>
		
		<file category="header" name="Device/SDK/cfgwiz/TLE986x_20/v2/adc2_defines.h" 			attr="config" condition="TLE986x_20" version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE986x_40/v2/adc2_defines.h" 			attr="config" condition="TLE986x_40" version="1.8.6"/>

		<file category="header" name="Device/SDK/cfgwiz/TLE986x_20/v2/bdrv_defines.h" 			attr="config" condition="TLE986x_20" version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE986x_40/v2/bdrv_defines.h" 			attr="config" condition="TLE986x_40" version="1.8.6"/>
		
